In [96]:
import numpy as np
import pandas as pd

In [97]:
sozluk1 = {"İsim" : ["Ahmet","Mehmet","Zeynep","Atıl"], 
           "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori" : [100, 200, 300, 400] 
          }

In [98]:
dataFrame1 = pd.DataFrame(sozluk1, index = [0, 1, 2, 3])

In [99]:
dataFrame1

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [100]:
sozluk2 = {"İsim" : ["Osman","Levent","Atlas","Fatma"], 
           "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori" : [200, 100, 50, 300] 
          }

In [101]:
dataFrame2 = pd.DataFrame(sozluk2, index = [4, 5, 6, 7])

In [102]:
sozluk3 = {"İsim" : ["Ayşe","Mahmut","Duygu","Nur"], 
           "Spor" : ["Koşu","Yüzme","Badminton","Tenis"],
           "Kalori" : [300, 400, 500, 250] 
          }

In [103]:
dataFrame3 = pd.DataFrame(sozluk3, index = [8, 9, 10, 11])

In [104]:
dataFrame2

     İsim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [105]:
dataFrame3

      İsim       Spor  Kalori
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## concatenation

In [106]:
pd.concat([dataFrame1, dataFrame2, dataFrame3], axis = 0)

      İsim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## merge

In [107]:
yeniSozluk1 = {"İsim" : ["Ahmet","Mehmet","Zeynep","Atıl"], 
           "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
              }

In [108]:
yeniDataFrame1 = pd.DataFrame(yeniSozluk1)

In [109]:
yeniDataFrame1

     İsim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [110]:
yeniSozluk2 = {"İsim" : ["Ahmet","Mehmet","Zeynep","Atıl"], 
            "Kalori" : [200, 100, 50, 300] 
              }

In [111]:
yeniDataFrame2 = pd.DataFrame(yeniSozluk2)

In [112]:
yeniDataFrame2

     İsim  Kalori
0   Ahmet     200
1  Mehmet     100
2  Zeynep      50
3    Atıl     300

In [113]:
pd.merge(yeniDataFrame1, yeniDataFrame2, on = "İsim")

     İsim       Spor  Kalori
0   Ahmet       Koşu     200
1  Mehmet      Yüzme     100
2  Zeynep       Koşu      50
3    Atıl  Basketbol     300

on = iki dataframe de ortak olan

In [114]:
maasSozluk = {"İsim" : ["Atıl", "Zeynep", "Mehmet", "Ahmet"],
              "Departman" : ["Yazılım", "Satış", "Pazarlama", "Yazılım"],
              "Maaş" : [200, 300, 400, 500]
             }

In [115]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [116]:
maasDataFrame

     İsim  Departman  Maaş
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [117]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

sadece özgü olanları getir

In [118]:
maasDataFrame["Departman"].nunique()

3

kaç tane özgün var

In [119]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [120]:
def bruttenNete(maas):
    return maas * 0.66

In [121]:
maasDataFrame["Maaş"]

0    200
1    300
2    400
3    500
Name: Maaş, dtype: int64

In [122]:
maasDataFrame["Maaş"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maaş, dtype: float64

In [123]:
maasDataFrame.isnull()

    İsim  Departman   Maaş
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

null var mı?

In [124]:
yeniBirSozluk = {"Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson","Simpson"],
                 "Karakter İsmi" : ["Cartman", "Kenny", "Homer", "Bart", "Bart"],
                 "Karakter Puanı" : [9, 10, 50, 20, 10]
                }

In [125]:
karakterDF = pd.DataFrame(yeniBirSozluk)

In [126]:
karakterDF

  Karakter Sınıfı Karakter İsmi  Karakter Puanı
0      South Park       Cartman               9
1      South Park         Kenny              10
2         Simpson         Homer              50
3         Simpson          Bart              20
4         Simpson          Bart              10

In [127]:
karakterDF.pivot_table(values = "Karakter Puanı", index = ["Karakter Sınıfı", "Karakter İsmi"])

                               Karakter Puanı
Karakter Sınıfı Karakter İsmi
Simpson         Bart                     15.0
                Homer                    50.0
South Park      Cartman                   9.0
                Kenny                    10.0

In [129]:
karakterDF.pivot_table(values = "Karakter Puanı", index = ["Karakter Sınıfı", "Karakter İsmi"],aggfunc="sum")

                               Karakter Puanı
Karakter Sınıfı Karakter İsmi
Simpson         Bart                       30
                Homer                      50
South Park      Cartman                     9
                Kenny                      10

aggfunc = np.sum belirtilmezse default olarak ortalama alır. böylece toplamı almış oldu.